demonstracoes/delphi/Win32/Debug/Templates/vm50b/RO/pedido_status.soap

<?xml version="1.0" encoding="utf-8"?><SOAP-ENV:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"><SOAP-ENV:Header><nfeCabecMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeStatusServico2"><cUF>%s</cUF><versaoDados>3.10</versaoDados></nfeCabecMsg></SOAP-ENV:Header><SOAP-ENV:Body><nfeDadosMsg xmlns="http://www.portalfiscal.inf.br/nfe/wsdl/NfeStatusServico2">%s</nfeDadosMsg></SOAP-ENV:Body></SOAP-ENV:Envelope>